released/M031BSP_I2C_Master_Slave/SampleCode/Template/i2c_conf.h

#include <stdio.h>
#include "NuMicro.h"


#define MASTER_I2C						  		(I2C0)
#define MASTER_I2C_IRQn						  	(I2C0_IRQn)
#define I2Cx_Master_IRQHandler					(I2C0_IRQHandler)

//#define MASTER_I2C						  		(I2C1)
//#define MASTER_I2C_IRQn						  	(I2C1_IRQn)
//#define I2Cx_Master_IRQHandler					(I2C1_IRQHandler)

#define MASTER_START_TRANSMIT			  		(0x08)
#define MASTER_REPEAT_START               		(0x10)
#define MASTER_TRANSMIT_ADDRESS_ACK       	(0x18)
#define MASTER_TRANSMIT_ADDRESS_NACK      	(0x20)
#define MASTER_TRANSMIT_DATA_ACK          	(0x28)
#define MASTER_TRANSMIT_DATA_NACK         	(0x30)
#define MASTER_ARBITRATION_LOST           		(0x38)
#define MASTER_RECEIVE_ADDRESS_ACK        		(0x40)
#define MASTER_RECEIVE_ADDRESS_NACK       		(0x48)
#define MASTER_RECEIVE_DATA_ACK           		(0x50)
#define MASTER_RECEIVE_DATA_NACK          		(0x58)
#define BUS_ERROR                         		(0x00)

//#define DEBUG_LOG_MASTER_LV1

#define MASTER_I2C_USE_IRQ
//#define MASTER_I2C_USE_POLLING


#define SLAVE_I2C						  		(I2C0)
#define SLAVE_I2C_IRQn						  	(I2C0_IRQn)
#define I2Cx_Slave_IRQHandler						(I2C0_IRQHandler)

#define SLAVE_TRANSMIT_REPEAT_START_OR_STOP	(0xA0)
#define SLAVE_TRANSMIT_ADDRESS_ACK 			(0xA8)
#define SLAVE_TRANSMIT_DATA_ACK				(0xB8)
#define SLAVE_TRANSMIT_DATA_NACK             	(0xC0)
#define SLAVE_TRANSMIT_LAST_DATA_ACK         	(0xC8)
#define SLAVE_RECEIVE_ADDRESS_ACK            	(0x60)
#define SLAVE_RECEIVE_ARBITRATION_LOST       	(0x68)
#define SLAVE_RECEIVE_DATA_ACK               	(0x80)
#define SLAVE_RECEIVE_DATA_NACK              	(0x88)
#define GC_MODE_ADDRESS_ACK                	(0x70)
#define GC_MODE_ARBITRATION_LOST             	(0x78)
#define GC_MODE_DATA_ACK                   	(0x90)
#define GC_MODE_DATA_NACK                  	(0x98)
#define ADDRESS_TRANSMIT_ARBITRATION_LOST    	(0xB0)

//#define DEBUG_LOG_SLAVE_LV1
#define DEBUG_LOG_SLAVE_LV2



